In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [9]:
csv_file = "../ETL_Project/average_wages.csv"
avg_wages_df = pd.read_table(csv_file,sep=',')
avg_wages_df.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value  Flag Codes
0      AUS    AVWAGE     TOT     USD         A  1990  39073         NaN
1      AUS    AVWAGE     TOT     USD         A  1991  38864         NaN
2      AUS    AVWAGE     TOT     USD         A  1992  39626         NaN
3      AUS    AVWAGE     TOT     USD         A  1993  40003         NaN
4      AUS    AVWAGE     TOT     USD         A  1994  40295         NaN

In [11]:
avg_wages_drop = avg_wages_df[['LOCATION','MEASURE','TIME','Value']]
avg_wages_drop.head()

  LOCATION MEASURE  TIME  Value
0      AUS     USD  1990  39073
1      AUS     USD  1991  38864
2      AUS     USD  1992  39626
3      AUS     USD  1993  40003
4      AUS     USD  1994  40295

In [35]:
avg_wages_drop.dtypes

LOCATION    object
MEASURE     object
TIME         int64
Value        int64
dtype: object

In [37]:
avg_wages_drop['TIME'].unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016])

In [36]:
avg_wages_2018 = avg_wages_drop[avg_wages_drop['TIME']==2018]
avg_wages_2018

Empty DataFrame
Columns: [LOCATION, MEASURE, TIME, Value]
Index: []

In [30]:
avg_wages_df_2018 = avg_wages_drop.loc[avg_wages_drop['TIME']=='2018']
avg_wages_df_2018.head()

/Users/miiinaa223/anaconda3/lib/python3.6/site-packages/pandas/core/ops.py:1167: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

TypeError: invalid type comparison